src/main/resources/examples/serviceDetails.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://thalesgroup.com/RTTI/2013-11-28/Token/types" xmlns:ldb="http://thalesgroup.com/RTTI/2017-10-01/ldb/">
   <soapenv:Header>
      <typ:AccessToken>
         <typ:TokenValue>b0ea9cb7-1dd5-4642-88d2-1c2cea541765</typ:TokenValue>
      </typ:AccessToken>
   </soapenv:Header>
   <soapenv:Body>
      <ldb:GetServiceDetailsRequest>
         <ldb:serviceID>QHmkaqFpGIT/CBq9w/YRNw==</ldb:serviceID>
      </ldb:GetServiceDetailsRequest>
   </soapenv:Body>
</soapenv:Envelope>


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <GetServiceDetailsResponse xmlns="http://thalesgroup.com/RTTI/2017-10-01/ldb/">
         <GetServiceDetailsResult xmlns:lt="http://thalesgroup.com/RTTI/2012-01-13/ldb/types" xmlns:lt6="http://thalesgroup.com/RTTI/2017-02-02/ldb/types" xmlns:lt7="http://thalesgroup.com/RTTI/2017-10-01/ldb/types" xmlns:lt4="http://thalesgroup.com/RTTI/2015-11-27/ldb/types" xmlns:lt5="http://thalesgroup.com/RTTI/2016-02-16/ldb/types" xmlns:lt2="http://thalesgroup.com/RTTI/2014-02-20/ldb/types" xmlns:lt3="http://thalesgroup.com/RTTI/2015-05-14/ldb/types">
            <lt7:generatedAt>2018-11-30T08:27:51.9640253+00:00</lt7:generatedAt>
            <lt7:serviceType>train</lt7:serviceType>
            <lt7:locationName>Hereford</lt7:locationName>
            <lt7:crs>HFD</lt7:crs>
            <lt7:operator>West Midlands Trains</lt7:operator>
            <lt7:operatorCode>LM</lt7:operatorCode>
            <lt7:rsid>LM297900</lt7:rsid>
            <lt7:std>08:45</lt7:std>
            <lt7:etd>On time</lt7:etd>
            <lt7:subsequentCallingPoints>
               <lt7:callingPointList>
                  <lt7:callingPoint>
                     <lt7:locationName>Ledbury</lt7:locationName>
                     <lt7:crs>LED</lt7:crs>
                     <lt7:st>09:03</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>Colwall</lt7:locationName>
                     <lt7:crs>CWL</lt7:crs>
                     <lt7:st>09:13</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>Great Malvern</lt7:locationName>
                     <lt7:crs>GMV</lt7:crs>
                     <lt7:st>09:17</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>Malvern Link</lt7:locationName>
                     <lt7:crs>MVL</lt7:crs>
                     <lt7:st>09:20</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>Worcester Foregate Street</lt7:locationName>
                     <lt7:crs>WOF</lt7:crs>
                     <lt7:st>09:30</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>Worcester Shrub Hill</lt7:locationName>
                     <lt7:crs>WOS</lt7:crs>
                     <lt7:st>09:33</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>Droitwich Spa</lt7:locationName>
                     <lt7:crs>DTW</lt7:crs>
                     <lt7:st>09:43</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>Bromsgrove</lt7:locationName>
                     <lt7:crs>BMV</lt7:crs>
                     <lt7:st>09:53</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>University</lt7:locationName>
                     <lt7:crs>UNI</lt7:crs>
                     <lt7:st>10:09</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
                  <lt7:callingPoint>
                     <lt7:locationName>Birmingham New Street</lt7:locationName>
                     <lt7:crs>BHM</lt7:crs>
                     <lt7:st>10:19</lt7:st>
                     <lt7:et>On time</lt7:et>
                  </lt7:callingPoint>
               </lt7:callingPointList>
            </lt7:subsequentCallingPoints>
         </GetServiceDetailsResult>
      </GetServiceDetailsResponse>
   </soap:Body>
</soap:Envelope>


POST https://lite.realtime.nationalrail.co.uk/OpenLDBWS/ldb11.asmx HTTP/1.1
Accept-Encoding: gzip,deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: "http://thalesgroup.com/RTTI/2012-01-13/ldb/GetServiceDetails"
Content-Length: 561
Host: lite.realtime.nationalrail.co.uk
Connection: Keep-Alive
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)

